ERP DEV.WMS/src/InformationRegisters/вмс_ШтрихкодыРасширенный/вмс_ШтрихкодыРасширенный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_ШтрихкодыРасширенный</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Контейнер</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.вмс_ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.вмс_СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетныйПараметр1</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/InformationRegisters/вмс_ШтрихкодыРасширенный/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьКоэффициентыУпаковок() Экспорт
	
	//3.2.5 - Первичное заполнение коэффициентов упаковок
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_ШтрихкодыРасширенный.Штрихкод КАК Штрихкод,
	|	вмс_ШтрихкодыРасширенный.Контейнер КАК Контейнер,
	|	вмс_ШтрихкодыРасширенный.Номенклатура КАК Номенклатура,
	|	вмс_ШтрихкодыРасширенный.Характеристика КАК Характеристика,
	|	вмс_ШтрихкодыРасширенный.Партия КАК Партия,
	|	вмс_ШтрихкодыРасширенный.Серия КАК Серия,
	|	вмс_ШтрихкодыРасширенный.Упаковка КАК Упаковка,
	|	вмс_ШтрихкодыРасширенный.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.вмс_ШтрихкодыРасширенный КАК вмс_ШтрихкодыРасширенный";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	НачатьТранзакцию();
	
	Попытка
		Пока Выборка.Следующий() Цикл
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Штрихкод.Установить(Выборка.Штрихкод);
			НаборЗаписей.Отбор.Контейнер.Установить(Выборка.Контейнер);
			НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
			НаборЗаписей.Отбор.Характеристика.Установить(Выборка.Характеристика);
			НаборЗаписей.Отбор.Партия.Установить(Выборка.Партия);
			НаборЗаписей.Отбор.Серия.Установить(Выборка.Серия);
			НаборЗаписей.Отбор.Упаковка.Установить(Выборка.Упаковка);
			
			НаборЗаписей.Прочитать();
			
			Для каждого Запись Из НаборЗаписей Цикл
				Коэффициент = вмс_АдаптацияКонфигураций.КоэффициентУпаковки(Запись.Упаковка, Запись.Номенклатура);
				Если ЗначениеЗаполнено(Коэффициент) Тогда
					Запись.Количество = Коэффициент;
				Иначе
					Запись.Количество = 1;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
	КонецПопытки;
	
КонецФункции


#КонецОбласти
